2054131414/Threadx-STM32F407/STM32F407VGT6/Drivers/BSP/Component/sfud/port/sfud_port.c
/*
 * This file is part of the Serial Flash Universal Driver Library.
 *
 * Copyright (c) 2016-2018, Armink, <armink.ztl@gmail.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the
 * 'Software'), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
 * CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
 * TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * Function: Portable interface for each platform.
 * Created on: 2016-04-23
 */

#include <sfud.h>
#include <stdarg.h>
#include <string.h>
#include <stm32f4xx_hal.h>

#define SPI1_CS_Pin        GPIO_PIN_6
#define SPI1_CS_GPIO_Port  GPIOB

typedef struct
{
    SPI_HandleTypeDef* hspix;
    GPIO_TypeDef* cs_gpiox;
    uint16_t cs_gpio_pin;
} spi_user_data, *spi_user_data_t;

static SPI_HandleTypeDef hspi1;

static spi_user_data spi1 =
{
    .hspix       = &hspi1,
    .cs_gpiox    = SPI1_CS_GPIO_Port,
    .cs_gpio_pin = SPI1_CS_Pin
};

static char log_buf[256];

void sfud_log_debug(const char* file, const long line, const char* format, ...);

static void spi_lock(const sfud_spi* spi)
{
    __disable_irq();
}

static void spi_unlock(const sfud_spi* spi)
{
    __enable_irq();
}

static void retry_delay_100us(void)
{
    uint32_t delay = 120;
    while(delay--);
}

/**
 * SPI write data then read data
 */
static sfud_err spi_write_read(const sfud_spi* spi, const uint8_t* write_buf, size_t write_size, uint8_t* read_buf,
                               size_t read_size)
{
    sfud_err result = SFUD_SUCCESS;
    uint8_t send_data, read_data;

    /**
     * add your spi write and read code
     */
    spi_user_data_t spi_dev = (spi_user_data_t) spi->user_data;

    if(write_size)
    {
        SFUD_ASSERT(write_buf);
    }
    if(read_size)
    {
        SFUD_ASSERT(read_buf);
    }

    HAL_GPIO_WritePin(spi_dev->cs_gpiox, spi_dev->cs_gpio_pin, GPIO_PIN_RESET);

    for(size_t i = 0, retry_times; i < write_size + read_size; i++)
    {

        if(i < write_size)
        {
            send_data = *write_buf++;
        }
        else
        {
            send_data = SFUD_DUMMY_DATA;
        }
        
        if (HAL_SPI_TransmitReceive(spi_dev->hspix, &send_data, &read_data, 1, 1000) != HAL_OK)
        {
            result = SFUD_ERR_TIMEOUT;
        }
        
        if (i >= write_size)
        {
            *read_buf++ = read_data;
        }
    }
    
    while(HAL_SPI_GetState(spi_dev->hspix) != HAL_SPI_STATE_READY);
    HAL_GPIO_WritePin(spi_dev->cs_gpiox, spi_dev->cs_gpio_pin, GPIO_PIN_SET);

    return result;
}

#ifdef SFUD_USING_QSPI
/**
 * read flash data by QSPI
 */
static sfud_err qspi_read(const struct __sfud_spi* spi, uint32_t addr, sfud_qspi_read_cmd_format* qspi_read_cmd_format,
                          uint8_t* read_buf, size_t read_size)
{
    sfud_err result = SFUD_SUCCESS;

    /**
     * add your qspi read flash data code
     */

    return result;
}
#endif /* SFUD_USING_QSPI */

sfud_err sfud_spi_port_init(sfud_flash* flash)
{
    sfud_err result = SFUD_SUCCESS;
    
    if(!strcmp(flash->spi.name, "SPI1"))
    {
        extern void MX_SPI1_Init(void);
        MX_SPI1_Init();
        
        /* Synchronize the interfaces and data required for Flash porting */
        flash->spi.wr        = spi_write_read;
        flash->spi.lock      = spi_lock;
        flash->spi.unlock    = spi_unlock;
        flash->spi.user_data = &spi1;

        /* about 100 microsecond delay */
        flash->retry.delay   = retry_delay_100us;

        /* adout 60 seconds timeout */
        flash->retry.times   = 60 * 10000;
    }
    
    return result;
}

/**
 * This function is print debug info.
 *
 * @param file the file which has call this function
 * @param line the line number which has call this function
 * @param format output format
 * @param ... args
 */
void sfud_log_debug(const char* file, const long line, const char* format, ...)
{
    va_list args;

    /* args point to the first variable parameter */
    va_start(args, format);
    printf("[SFUD](%s:%ld) ", file, line);
    /* must use vprintf to print */
    vsnprintf(log_buf, sizeof(log_buf), format, args);
    printf("%s\n", log_buf);
    va_end(args);
}

/**
 * This function is print routine info.
 *
 * @param format output format
 * @param ... args
 */
void sfud_log_info(const char* format, ...)
{
    va_list args;

    /* args point to the first variable parameter */
    va_start(args, format);
    printf("[SFUD]");
    /* must use vprintf to print */
    vsnprintf(log_buf, sizeof(log_buf), format, args);
    printf("%s\n", log_buf);
    va_end(args);
}
